content/post/herramientas-desarrollo.md
+++
title = "Herramientas de desarrollo"
date = 2019-09-24T00:43:00+02:00
categories = ["diw", "diw-herramientas-desarrollo"]
draft = false
+++

A continuación se muestran algunas herramientas de desarrollo que considero interesantes. Este artículo estará en continua revisión.

<!--more-->


## Editores {#editores}

-   [Visual Studio Code](https://code.visualstudio.com/)
-   [Atom](https://atom.io/)
-   [Brackets](http://brackets.io/)
-   [Sublime Text](https://www.sublimetext.com/)
-   [Notepad ++](https://notepad-plus-plus.org/)
-   [Emmet (plugin)](http://emmet.io/)


### IDEs {#ides}

-   [Eclipse](http://www.eclipse.org)
    -   [Paquete para JavaScript](http://www.eclipse.org/downloads/packages/eclipse-ide-javascript-web-developers/indigosr2)
-   [Netbeans](https://netbeans.org)
    -   [Soporte para JavaScript](https://netbeans.org/kb/73/ide/javascript-editor.html)


## Editores online para prototipos rápidos {#editores-online-para-prototipos-rápidos}

-   <https://jsbin.com>
-   <https://jsfiddle.net/>
-   <http://codepen.io/>
-   <https://www.jsnippet.net/>


## Herramientas de desarrollo de navegadores {#herramientas-de-desarrollo-de-navegadores}

-   [Chrome DevTools](https://developers.google.com/web/tools/chrome-devtools/) (Chrome)
-   [Firefox Dev Tools](https://developer.mozilla.org/es/docs/Tools) (Firefox)


## Servicios de validación {#servicios-de-validación}

-   [W3C HTML Validation Service](https://validator.w3.org/)
-   [W3C CSS Validation Service](https://jigsaw.w3.org/css-validator/)
-   [JSLint](http://www.jslint.com) (Chequeo de sintaxis y código JavaScript)


## Git {#git}

-   [Git para Windows](https://git-scm.com/download/win)


## Node (plataforma de desarrollo en JavaScript) {#node--plataforma-de-desarrollo-en-javascript}

-   [Node JS](https://nodejs.org/en/)
-   [Node packages](https://www.npmjs.com/)


## Diagramas y diseño {#diagramas-y-diseño}

-   [PlantUml](http://plantuml.com)
-   [Draw.io](https://draw.io)


## Licencias {#licencias}

-   [Copyright](https://en.wikipedia.org/wiki/Copyright)
-   [Copyleft](https://en.wikipedia.org/wiki/Copyleft)
-   [Open Source Definition](https://opensource.org/osd.html)
-   [Choose a License](http://choosealicense.com)
-   [Creative Commons licenses](https://creativecommons.org/share-your-work/) (Para creaciones que no son código, como sitios web, multimedia, textos, libros, etc.)
